work/HOWTO_linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HOWTO do Linux kernel development</title>
<!-- 2016-07-20 Wed 16:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">HOWTO do Linux kernel development</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 介绍</a></li>
<li><a href="#sec-2">2. 法律问题</a></li>
<li><a href="#sec-3">3. 文档</a>
<ul>
<li><a href="#sec-3-1">3.1. README</a></li>
<li><a href="#sec-3-2">3.2. Documentation/Changes</a></li>
<li><a href="#sec-3-3">3.3. Documentation/CodingStyle</a></li>
<li><a href="#sec-3-4">3.4. Documentation/SubmittingPatches</a></li>
<li><a href="#sec-3-5">3.5. Documentation/SubmittingDrivers</a></li>
<li><a href="#sec-3-6">3.6. Documentation/stable<sub>api</sub><sub>nonsense</sub>.txt</a></li>
<li><a href="#sec-3-7">3.7. Documentation/SecurityBugs</a></li>
<li><a href="#sec-3-8">3.8. Documentation/ManagementStyle</a></li>
<li><a href="#sec-3-9">3.9. Documentation/stable<sub>kernel</sub><sub>rules</sub>.txt</a></li>
<li><a href="#sec-3-10">3.10. Documentation/kernel-docs.txt</a></li>
<li><a href="#sec-3-11">3.11. Documentation/applying-patches.txt</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 成为一个内核开发者</a></li>
<li><a href="#sec-5">5. 开发流程</a></li>
<li><a href="#sec-6">6. bug 上报</a></li>
<li><a href="#sec-7">7. 最后</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 介绍</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 法律问题</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 文档</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> README</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This file gives a short background on the Linux kernel and describes
what is necessary to do to configure and build the kernel.  People
who are new to the kernel should start here.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Documentation/Changes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This file gives a list of the minimum levels of various software
packages that are necessary to build and run the kernel
successfully.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Documentation/CodingStyle</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This describes the Linux kernel coding style, and some of the
rationale behind it. All new code is expected to follow the
guidelines in this document. Most maintainers will only accept
patches if these rules are followed, and many people will only
review code if it is in the proper style.
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Documentation/SubmittingPatches</h3>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Documentation/SubmittingDrivers</h3>
<div class="outline-text-3" id="text-3-5">
<p>
These files describe in explicit detail how to successfully create
and send a patch, including (but not limited to):
</p>
<ul class="org-ul">
<li>Email contents
</li>
<li>Email format
</li>
<li>Who to send it to
</li>
</ul>
<p>
Following these rules will not guarantee success (as all patches are
subject to scrutiny for content and style), but not following them
will almost always prevent it.
</p>

<p>
Other excellent descriptions of how to create patches properly are:
"The Perfect Patch"
    <a href="http://userweb.kernel.org/~akpm/stuff/tpp.txt">http://userweb.kernel.org/~akpm/stuff/tpp.txt</a>
"Linux kernel patch submission format"
    <a href="http://linux.yyz.us/patch-format.html">http://linux.yyz.us/patch-format.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Documentation/stable<sub>api</sub><sub>nonsense</sub>.txt</h3>
<div class="outline-text-3" id="text-3-6">
<p>
This file describes the rationale behind the conscious decision to
not have a stable API within the kernel, including things like:
</p>
<ul class="org-ul">
<li>Subsystem shim-layers (for compatibility?)
</li>
<li>Driver portability between Operating Systems.
</li>
<li>Mitigating rapid change within the kernel source tree (or
</li>
</ul>
<p>
preventing rapid change)
This document is crucial for understanding the Linux development
philosophy and is very important for people moving to Linux from
development on other Operating Systems.
</p>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Documentation/SecurityBugs</h3>
<div class="outline-text-3" id="text-3-7">
<p>
If you feel you have found a security problem in the Linux kernel,
please follow the steps in this document to help notify the kernel
developers, and help solve the issue.
</p>
</div>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Documentation/ManagementStyle</h3>
<div class="outline-text-3" id="text-3-8">
<p>
This document describes how Linux kernel maintainers operate and the
shared ethos behind their methodologies.  This is important reading
for anyone new to kernel development (or anyone simply curious about
it), as it resolves a lot of common misconceptions and confusion
about the unique behavior of kernel maintainers.
</p>
</div>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Documentation/stable<sub>kernel</sub><sub>rules</sub>.txt</h3>
<div class="outline-text-3" id="text-3-9">
<p>
This file describes the rules on how the stable kernel releases
happen, and what to do if you want to get a change into one of these
releases.
</p>
</div>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Documentation/kernel-docs.txt</h3>
<div class="outline-text-3" id="text-3-10">
<p>
A list of external documentation that pertains to kernel
development.  Please consult this list if you do not find what you
are looking for within the in-kernel documentation.
</p>
</div>
</div>
<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> Documentation/applying-patches.txt</h3>
<div class="outline-text-3" id="text-3-11">
<p>
A good introduction describing exactly what a patch is and how to
apply it to the different development branches of the kernel.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 成为一个内核开发者</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li></li>
</ol>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 开发流程</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> bug 上报</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 最后</h2>
<div class="outline-text-2" id="text-7">
<p>
All of these things are sometimes very hard to do. It can take years to perfect these practices (if at all). It's a continuous process of improvement that requires a lot of patience and determination. But don't give up, it's possible. Many have done it before, and each had to start exactly where you are now.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-07-20 Wed 16:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
